In [9]:
import pandas as pd
df = pd.read_csv('match-results.csv') #returns a data frame object
df

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False
2,1874-03-07,Scotland,England,2,1,Friendly,Glasgow,Scotland,False
3,1875-03-06,England,Scotland,2,2,Friendly,London,England,False
4,1876-03-04,Scotland,England,3,0,Friendly,Glasgow,Scotland,False
...,...,...,...,...,...,...,...,...,...
41581,2020-01-10,Barbados,Canada,1,4,Friendly,Irvine,United States,True
41582,2020-01-12,Kosovo,Sweden,0,1,Friendly,Doha,Qatar,True
41583,2020-01-15,Canada,Iceland,0,1,Friendly,Irvine,United States,True
41584,2020-01-19,El Salvador,Iceland,0,1,Friendly,Carson,United States,True
41585,2020-02-01,United States,Costa Rica,1,0,Friendly,Carson,United States,False

In [14]:
df.shape

(41586, 9)

In [13]:
df.describe()

         home_score    away_score
count  41586.000000  41586.000000
mean       1.745756      1.187587
std        1.753780      1.405323
min        0.000000      0.000000
25%        1.000000      0.000000
50%        1.000000      1.000000
75%        2.000000      2.000000
max       31.000000     21.000000

In [15]:
df.values

array([['1872-11-30', 'Scotland', 'England', ..., 'Glasgow', 'Scotland',
        False],
       ['1873-03-08', 'England', 'Scotland', ..., 'London', 'England',
        False],
       ['1874-03-07', 'Scotland', 'England', ..., 'Glasgow', 'Scotland',
        False],
       ...,
       ['2020-01-15', 'Canada', 'Iceland', ..., 'Irvine',
        'United States', True],
       ['2020-01-19', 'El Salvador', 'Iceland', ..., 'Carson',
        'United States', True],
       ['2020-02-01', 'United States', 'Costa Rica', ..., 'Carson',
        'United States', False]], dtype=object)